//
//  MerchantData.m
//  17sports
//
//  Created by mebusw on 13-8-19.
//  Copyright (c) 2013年 mebusw. All rights reserved.
//

#import "MerchantData.h"

@implementation MerchantData

+(NSArray*) allMerchants {
    return [MerchantData allMerchantsOfGolf];
}


+(NSArray*) allMerchantsOfGolf {
    return [NSMutableArray arrayWithArray:@[
            @{
            @"id": @67,
            @"name": @"天津峪景山地高尔夫俱乐部",
            @"latitude": @40.094230,
            @"longitude": @117.523355,
            @"address": @"天津市蓟县毛家峪长寿度假村",
            @"phone": @"022-88826203",
            @"price": @"760",
            @"images": @[@"67.jpg"],
            @"introduction": @"球场内地形险峻，落差超过164码，18个球洞全部建在著名风景区盘山东麓的山体上。"
            },
            @{
            @"id": @68,
            @"name": @"天津杨柳青高尔夫俱乐部",
            @"latitude": @39.1488,
            @"longitude": @117.008188,
            @"address": @"天津市西青区杨柳青镇一经路立交桥北",
            @"phone": @"022-27937878",
            @"price": @"400",
            @"images": @[@"68.jpg"],
            @"introduction": @"于1999年十月正式对外营业的杨柳青高尔夫俱乐部是一个大型的国际锦标级具有三十六个球洞的高尔夫度假村。"
            },
            @{
            @"id": @69,
            @"name": @"天津天鹅湖高尔夫俱乐部",
            @"latitude": @39.404747,
            @"longitude": @117.057755,
            @"address": @"天津市武清开发区福源道20号",
            @"phone": @"022-82115588",
            @"price": @"600",
            @"images": @[@"69.jpg"],
            @"introduction": @"标准为9洞36杆，球场三面环水，梯台及果岭置于岛上，极具挑战且难度较大。"
            },
            @{
            @"id": @70,
            @"name": @"天津京基高尔夫俱乐部",
            @"latitude": @38.974625,
            @"longitude": @117.292736,
            @"address": @"天津市津南区八里台镇津港公路北侧",
            @"phone": @"022-58378111",
            @"price": @"400",
            @"images": @[@"70.jpg"],
            @"introduction": @"球场占地面积1100亩，为国际标准18洞锦标赛场地，标准杆72杆，球道总长度6961码。"
            },
            @{
            @"id": @71,
            @"name": @"天津国际温泉高尔夫俱乐部",
            @"latitude": @39.138036,
            @"longitude": @117.388375,
            @"address": @"天津市空港经济区中心大道西五道",
            @"phone": @"022-24891930/0391",
            @"price": @"510",
            @"images": @[@"71.jpg"],
            @"introduction": @"球场占地面积67.5万平方米，建筑面积7400余平方米，属国际标准18孔道高球夫球场。"
            },
            @{
            @"id": @72,
            @"name": @"天津华纳高尔夫俱乐部",
            @"latitude": @39.025052,
            @"longitude": @117.688502,
            @"address": @"天津经济技术开发区南海路一号",
            @"phone": @"022-25326009",
            @"price": @"640",
            @"images": @[@"72.jpg"],
            @"introduction": @"华纳球场是一个球道全长6736码、标准72杆的18洞国际比赛标准球场。"
            },
            @{
            @"id": @73,
            @"name": @"天津龙海国际高尔夫俱乐部",
            @"latitude": @39.154336,
            @"longitude": @117.769891,
            @"address": @"天津市滨海新区218省道",
            @"phone": @"022-67201818",
            @"price": @"350",
            @"images": @[@"73.jpg"],
            @"introduction": @"该球场充分利用渤海海滨的天然景色和邻近水库区大片的沼泽地貌，创造出在中国境内独特的欧式海滨球场的风貌。"
            },
            @{
            @"id": @74,
            @"name": @"天津阿罗马高尔夫俱乐部",
            @"latitude": @38.937508,
            @"longitude": @117.548347,
            @"address": @"天津市滨海新区大港官森林公园绿化基地",
            @"phone": @"022-63285000",
            @"price": @"960",
            @"images": @[@"74.jpg"],
            @"introduction": @"俱乐部总占地面积2640000平方米。整个球场由韩国著名CNA高尔夫设计院按照国际标准精心设计并施工."
            },
            @{
            @"id": @75,
            @"name": @"天津京津新城帝景高尔夫俱乐部",
            @"latitude": @39.526669,
            @"longitude": @117.363552,
            @"address": @"天津市宝坻区京津新城内津蓟高速专设第三出口",
            @"phone": @"022-22412818",
            @"price": @"1080",
            @"images": @[@"75.jpg"],
            @"introduction": @"帝景高尔夫俱乐部拥有国际标准27洞高尔夫球场，前9洞水岸球场由美国著名设计大师J.Michael Poellot担当设计，球场，整体湖水环绕、小桥流水，设计风格迥异。"
            },
            @{
            @"id": @76,
            @"name": @"天津松江团泊湖高尔夫俱乐部",
            @"latitude": @38.914247,
            @"longitude": @117.159555,
            @"address": @"天津市静海县团泊镇津王路",
            @"phone": @"022-68505299",
            @"price": @"900",
            @"images": @[@"76.jpg"],
            @"introduction": @"球场由五届英国公开赛冠军Peter Thomson先生的TP公司负责设计。林克斯球场(C、D球场)设计巧妙刁钻、变化多端，炮台式果岭和深沉的沙坑是球场的一大特色。"
            },
            @{
            @"id": @77,
            @"name": @"天津江南领世郡高尔夫球场",
            @"latitude": @39.036277,
            @"longitude": @117.260722,
            @"address": @"天津市外环线17号桥(津港桥)东2公里处",
            @"phone": @"022-88829128",
            @"price": @"400",
            @"images": @[@"77.jpg"],
            @"introduction": @"拥有36个打位的天然真草练习场、星级高级会所一座、规划27洞国际标准高尔夫球场，其中包括9洞灯光球场。"
            },
            @{
            @"id": @78,
            @"name": @"天津滨海森林高尔夫球场",
            @"latitude": @39.097016,
            @"longitude": @117.679269,
            @"address": @"天津塘沽塘汉路789号",
            @"phone": @"022-25271000",
            @"price": @"600",
            @"images": @[@"78.jpg"],
            @"introduction": @"27洞总长为10937码，每18洞全长平均在7200码以上，标准杆72杆。"
            },
            @{
            @"id": @79,
            @"name": @"天津滨海湖高尔夫俱乐部",
            @"latitude": @39.145566,
            @"longitude": @117.556130,
            @"address": @"天津市滨海新区塘黄路塘黄分离式桥北400米处",
            @"phone": @"022-25271101",
            @"price": @"840",
            @"images": @[@"79.jpg"],
            @"introduction": @"锦标赛级别的球场包括南北两个18洞，其中北18洞位于湖心岛上，球道临水，岸线蜿蜒曲折。"
            },
            @{
            @"id": @80,
            @"name": @"天津蓟县盘山高尔夫俱乐部",
            @"latitude": @40.0695,
            @"longitude": @117.293627,
            @"address": @"蓟县燕山西大街706号",
            @"phone": @"022-59131222",
            @"price": @"500",
            @"images": @[@"80.jpg"],
            @"introduction": @"天津盘山高尔夫球会北依盘山，球场规模为36洞公园式国际标准高尔夫球场。"
            },
            @{
            @"id": @81,
            @"name": @"天津星耀五洲高尔夫俱乐部",
            @"latitude": @38.898369,
            @"longitude": @117.325197,
            @"address": @"天津津南区八里台镇天嘉湖星耀五洲",
            @"phone": @"022-60398027",
            @"price": @"660",
            @"images": @[@"81.jpg"],
            @"introduction": @"18洞锦标级球场总占地1100亩，环绕11000亩可与西湖水面相媲美的天嘉湖而建。"
            },
            @{
            @"id": @82,
            @"name": @"天津北国高尔夫练习场",
            @"latitude": @39.1016,
            @"longitude": @117.247869,
            @"address": @"天津市河东区光华路2号余门",
            @"phone": @"022-84283982",
            @"price": @"60元/100粒",
            @"images": @[@"82.jpg"],
            @"introduction": @"北国高尔夫练习场坐落在河东二宫体键中心院内，两层共设32个打位。"
            },
            @{
            @"id": @83,
            @"name": @"天津鼎基高尔夫练习场",
            @"latitude": @39.067508,
            @"longitude": @117.38445,
            @"address": @"天津市河东区津塘公路52号",
            @"phone": @"022-84111799",
            @"price": @"30元/50粒",
            @"images": @[@"83.jpg"],
            @"introduction": @""
            },
            @{
            @"id": @84,
            @"name": @"天津瑞景高尔夫练习场",
            @"latitude": @39.179311,
            @"longitude": @117.143238,
            @"address": @"天津市丁字沽三号路延长线瑞景居住区",
            @"phone": @"022-26685858",
            @"price": @"30元/位",
            @"images": @[@"84.jpg"],
            @"introduction": @"练习场占地4万余平方米，总长300码，内部装修高雅气派，设施规范合理。一层设打位26个。"
            },
            @{
            @"id": @85,
            @"name": @"天津迪康高尔夫练习场",
            @"latitude": @39.067338,
            @"longitude": @117.190072,
            @"address": @"天津市环湖中路与黑牛城道交口（南300米处）郁江西道旁",
            @"phone": @"022-23930001",
            @"price": @"",
            @"images": @[@"85.jpg"],
            @"introduction": @"迪康高尔夫练习场占地面积25000平方米，可击打170码的距离。场地设有40多个打位供球手练习。"
            },
            @{
            @"id": @86,
            @"name": @"天津三友高尔夫练习场",
            @"latitude": @39.060836,
            @"longitude": @117.66865,
            @"address": @"天津塘沽区海洋高新技术开发区金江路东",
            @"phone": @"022-25215598",
            @"price": @"",
            @"images": @[@"86.jpg"],
            @"introduction": @"拥有双层，40个打位，长240码，还拥有专业的高尔夫教学系统及挥球分析室，中、韩职业教练 。"
            },
            @{
            @"id": @87,
            @"name": @"森奥高尔夫练习场",
            @"latitude": @39.074469,
            @"longitude": @117.173158,
            @"address": @"天津市南开区卫津南路奥体中心东入口",
            @"phone": @"022-23350066 ",
            @"price": @"80元/100粒",
            @"images": @[@"87.jpg"],
            @"introduction": @"设置二层60个高球打席，击打距离约为200码"
            },
            @{
            @"id": @88,
            @"name": @"天津格瑞国际高尔夫练习场",
            @"latitude": @39.053763,
            @"longitude": @117.27305,
            @"address": @"天津市河西区浯水道58号",
            @"phone": @"022-88191188",
            @"price": @"",
            @"images": @[@"88.jpg"],
            @"introduction": @"高尔夫练习场打位60个草坪面积10万多平方米"
            },
            @{
            @"id": @89,
            @"name": @"天津park室内高尔夫练习场",
            @"latitude": @39.0777,
            @"longitude": @117.172030,
            @"address": @"天津南开区宾水西道奥林匹克中心体育场103-2室",
            @"phone": @"022-23820882",
            @"price": @"",
            @"images": @[@"89.jpg"],
            @"introduction": @"PGA高尔夫学院是一家集室内模拟高尔夫练习场及室内教学为一体的高尔夫教练场。"
            },
            @{
            @"id": @90,
            @"name": @"天津王朝高尔夫练习场",
            @"latitude": @39.269552,
            @"longitude": @117.228097,
            @"address": @"天津市北辰区津围公路29号王朝御苑酒堡庄园院内",
            @"phone": @"022-26894990",
            @"price": @"",
            @"images": @[@"90.jpg"],
            @"introduction": @"练习场占地面积30000平方米，全长260码，现有22个打位，两个VIP包房，视野广阔。"
            },
            @{
            @"id": @91, 
            @"name": @"天津松江高尔夫练习场", 
            @"latitude": @39.067263, 
            @"longitude": @117.21045, 
            @"address": @"天津市河西区友谊南路梅江南汐岸国际小区旁", 
            @"phone": @"022-28048012", 
            @"price": @"", 
            @"images": @[@"91.jpg"], 
            @"introduction": @"临近友谊南路梅江南，内部装修高雅气派，设施规范合理。"
            },
            @{
            @"id": @92, 
            @"name": @"天津滨海益友练习场", 
            @"latitude": @39.002258, 
            @"longitude": @117.705427, 
            @"address": @"天津市滨海新区新港二号路", 
            @"phone": @"022-25921188", 
            @"price": @"", 
            @"images": @[@"92.jpg"], 
            @"introduction": @"位于滨海新区新港二号路，远离市区，周边环境优美。"
            },
            @{
            @"id": @93, 
            @"name": @"天津天竺天池高尔夫球练习场", 
            @"latitude": @39.103319, 
            @"longitude": @117.173077, 
            @"address": @"天津市南开区八里台聂功桥西侧", 
            @"phone": @"022-23911593", 
            @"price": @"", 
            @"images": @[@"93.jpg"], 
            @"introduction": @"拥有总50杆的A、B、C、D四个室外练习场，还设有室内练习场以及室内模拟高尔夫设备。"
            },
            @{
            @"id": @94, 
            @"name": @"可那夫高尔夫练习场", 
            @"latitude": @39.086355, 
            @"longitude": @117.167302, 
            @"address": @"天津市南开区水上公园东路动物园东门旁50米处", 
            @"phone": @"022-23931210", 
            @"price": @"", 
            @"images": @[@"94.jpg"], 
            @"introduction": @"球场面积60000多平方米，清澈宽敞的湖面周围盘绕了9洞难度各异的模拟果岭、43个空间舒适的发球打位。"
            },
            @{
            @"id": @95, 
            @"name": @"JS室内高尔夫练习场", 
            @"latitude": @39.069038, 
            @"longitude": @117.143430, 
            @"address": @"河西区阳光100商业街2楼", 
            @"phone": @"022-83959878", 
            @"price": @"", 
            @"images": @[@"95.jpg"], 
            @"introduction": @"设有室内练习场以及室内模拟高尔夫设备，为高尔夫爱好者提供一个有力的练习平台。"
            },
            @{
            @"id": @96,
            @"name": @"天津G&G室内高尔夫练习场",
            @"latitude": @39.118905,
            @"longitude": @117.187316,
            @"address": @"天津和平区南京路92号增1号华侨大厦负2",
            @"phone": @"022-23921936",
            @"price": @"",
            @"images": @[@"96.jpg"],
            @"introduction": @"位于市区繁华路段，内部装修高雅气派，设施规范合理。"
            },
    ]];
}
@end
